## Part 1

<img src='Data/books ERD.png'>

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:Laspc051140!!@localhost/Book"

In [2]:
engine = create_engine(connection_str)

In [3]:
create_database(connection_str)

In [4]:
database_exists(connection_str)

True

In [5]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

## Part 2

In [6]:
import pandas as pd
df = pd.read_csv('Data/users.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
df.to_sql('users', engine, if_exists = 'replace')

3

In [8]:
df1 = pd.read_csv('Data/books.csv')
df1.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
df1.to_sql('books', engine, if_exists = 'replace')

6

In [10]:
df2 = pd.read_csv('Data/authors.csv')
df2.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [11]:
df2.to_sql('authors', engine, if_exists = 'replace')

5

In [13]:
df3 = pd.read_csv('Data/favorites.csv')
df3.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [14]:
df3.to_sql('favorites', engine, if_exists = 'replace')

7

In [15]:
q= """SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_book
0        authors
1          books
2      favorites
3          users

In [19]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id =
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" 
    AND users.first_name = "John"));"""
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1